Autodesk.Revit.DB.SlabShapeCreaseType
The type of a SlabShapeCrease

Autodesk.Revit.DB.SlabShapeCreaseType.Auto
the crease is automatically generated.

Autodesk.Revit.DB.SlabShapeCreaseType.UserDrawn
The crease is created by user.

Autodesk.Revit.DB.SlabShapeCreaseType.Boundary
The crease is on boundary.

Autodesk.Revit.DB.SlabShapeCreaseType.Invalid
The crease is invalid.